Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_dsihost.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32H747_CM4_dsihost.
; ======================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32H747_CM4_dsihost equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// DSIHOST address definitions
// ---------------------------

typedef struct {
    volatile    uint32_t    DSI_VR;
    volatile    uint32_t    DSI_CR;
    volatile    uint32_t    DSI_CCR;
    volatile    uint32_t    DSI_LVCIDR;
    volatile    uint32_t    DSI_LCOLCR;
    volatile    uint32_t    DSI_LPCR;
    volatile    uint32_t    DSI_LPMCR;
    volatile    uint32_t    RESERVED0[4];
    volatile    uint32_t    DSI_PCR;
    volatile    uint32_t    DSI_GVCIDR;
    volatile    uint32_t    DSI_MCR;
    volatile    uint32_t    DSI_VMCR;
    volatile    uint32_t    DSI_VPCR;
    volatile    uint32_t    DSI_VCCR;
    volatile    uint32_t    DSI_VNPCR;
    volatile    uint32_t    DSI_VHSACR;
    volatile    uint32_t    DSI_VHBPCR;
    volatile    uint32_t    DSI_VLCR;
    volatile    uint32_t    DSI_VVSACR;
    volatile    uint32_t    DSI_VVBPCR;
    volatile    uint32_t    DSI_VVFPCR;
    volatile    uint32_t    DSI_VVACR;
    volatile    uint32_t    DSI_LCCR;
    volatile    uint32_t    DSI_CMCR;
    volatile    uint32_t    DSI_GHCR;
    volatile    uint32_t    DSI_GPDR;
    volatile    uint32_t    DSI_GPSR;
    volatile    uint32_t    DSI_TCCR0;
    volatile    uint32_t    DSI_TCCR1;
    volatile    uint32_t    DSI_TCCR2;
    volatile    uint32_t    DSI_TCCR3;
    volatile    uint32_t    DSI_TCCR4;
    volatile    uint32_t    DSI_TCCR5;
    volatile    uint32_t    RESERVED1;
    volatile    uint32_t    DSI_CLCR;
    volatile    uint32_t    DSI_CLTCR;
    volatile    uint32_t    DSI_DLTCR;
    volatile    uint32_t    DSI_PCTLR;
    volatile    uint32_t    DSI_PCONFR;
    volatile    uint32_t    DSI_PUCR;
    volatile    uint32_t    DSI_PTTCR;
    volatile    uint32_t    DSI_PSR;
    volatile    uint32_t    RESERVED2[2];
    volatile    uint32_t    DSI_ISR0;
    volatile    uint32_t    DSI_ISR1;
    volatile    uint32_t    DSI_IER0;
    volatile    uint32_t    DSI_IER1;
    volatile    uint32_t    RESERVED3[3];
    volatile    uint32_t    DSI_FIR0;
    volatile    uint32_t    DSI_FIR1;
    volatile    uint32_t    RESERVED4[8];
    volatile    uint32_t    DSI_VSCR;
    volatile    uint32_t    RESERVED5[2];
    volatile    uint32_t    DSI_LCVCIDR;
    volatile    uint32_t    DSI_LCCCR;
    volatile    uint32_t    RESERVED6;
    volatile    uint32_t    DSI_LPMCCR;
    volatile    uint32_t    RESERVED7[7];
    volatile    uint32_t    DSI_VMCCR;
    volatile    uint32_t    DSI_VPCCR;
    volatile    uint32_t    DSI_VCCCR;
    volatile    uint32_t    DSI_VNPCCR;
    volatile    uint32_t    DSI_VHSACCR;
    volatile    uint32_t    DSI_VHBPCCR;
    volatile    uint32_t    DSI_VLCCR;
    volatile    uint32_t    DSI_VVSACCR;
    volatile    uint32_t    DSI_VVBPCCR;
    volatile    uint32_t    DSI_VVFPCCR;
    volatile    uint32_t    DSI_VVACCR;
    volatile    uint32_t    RESERVED8[167];
    volatile    uint32_t    DSI_WCFGR;
    volatile    uint32_t    DSI_WCR;
    volatile    uint32_t    DSI_WIER;
    volatile    uint32_t    DSI_WISR;
    volatile    uint32_t    DSI_WIFCR;
    volatile    uint32_t    RESERVED9;
    volatile    uint32_t    DSI_WPCR0;
    volatile    uint32_t    DSI_WPCR1;
    volatile    uint32_t    DSI_WPCR2;
    volatile    uint32_t    DSI_WPCR3;
    volatile    uint32_t    DSI_WPCR4;
    volatile    uint32_t    RESERVED10;
    volatile    uint32_t    DSI_WRPCR;
} DSIHOST_TypeDef;

#ifdef __cplusplus
#define DSIHOST reinterpret_cast<DSIHOST_TypeDef *>(0x50000000U)

#else
#define DSIHOST ((DSIHOST_TypeDef *)0x50000000U)
#endif

// DSI_VR Configuration

#define DSIHOST_DSI_VR_VERSION          (0xFFFFFFFFU<<0)
#define DSIHOST_DSI_VR_VERSION_0        (0x1U<<0)

// DSI_CR Configuration

#define DSIHOST_DSI_CR_EN               (0x1U<<0)

// DSI_CCR Configuration

#define DSIHOST_DSI_CCR_TOCKDIV         (0xFFU<<8)
#define DSIHOST_DSI_CCR_TOCKDIV_0       (0x1U<<8)
#define DSIHOST_DSI_CCR_TXECKDIV        (0xFFU<<0)
#define DSIHOST_DSI_CCR_TXECKDIV_0      (0x1U<<0)

