Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_dsihost.h
// DSI_LVCIDR Configuration

#define DSIHOST_DSI_LVCIDR_VCID         (0x3U<<0)
#define DSIHOST_DSI_LVCIDR_VCID_0       (0x1U<<0)

// DSI_LCOLCR Configuration

#define DSIHOST_DSI_LCOLCR_LPE          (0x1U<<8)
#define DSIHOST_DSI_LCOLCR_COLC         (0xFU<<0)
#define DSIHOST_DSI_LCOLCR_COLC_0       (0x1U<<0)

// DSI_LPCR Configuration

#define DSIHOST_DSI_LPCR_HSP            (0x1U<<2)
#define DSIHOST_DSI_LPCR_VSP            (0x1U<<1)
#define DSIHOST_DSI_LPCR_DEP            (0x1U<<0)

// DSI_LPMCR Configuration

#define DSIHOST_DSI_LPMCR_LPSIZE        (0xFFU<<16)
#define DSIHOST_DSI_LPMCR_LPSIZE_0      (0x1U<<16)
#define DSIHOST_DSI_LPMCR_VLPSIZE       (0xFFU<<0)
#define DSIHOST_DSI_LPMCR_VLPSIZE_0     (0x1U<<0)

// DSI_PCR Configuration

#define DSIHOST_DSI_PCR_CRCRXE          (0x1U<<4)
#define DSIHOST_DSI_PCR_ECCRXE          (0x1U<<3)
#define DSIHOST_DSI_PCR_BTAE            (0x1U<<2)
#define DSIHOST_DSI_PCR_ETRXE           (0x1U<<1)
#define DSIHOST_DSI_PCR_ETTXE           (0x1U<<0)

// DSI_GVCIDR Configuration

#define DSIHOST_DSI_GVCIDR_VCID         (0x3U<<0)
#define DSIHOST_DSI_GVCIDR_VCID_0       (0x1U<<0)

// DSI_MCR Configuration

#define DSIHOST_DSI_MCR_CMDM            (0x1U<<0)

// DSI_VMCR Configuration

#define DSIHOST_DSI_VMCR_PGO            (0x1U<<24)
#define DSIHOST_DSI_VMCR_PGM            (0x1U<<20)
#define DSIHOST_DSI_VMCR_PGE            (0x1U<<16)
#define DSIHOST_DSI_VMCR_LPCE           (0x1U<<15)
#define DSIHOST_DSI_VMCR_FBTAAE         (0x1U<<14)
#define DSIHOST_DSI_VMCR_LPHFPE         (0x1U<<13)
#define DSIHOST_DSI_VMCR_LPHBPE         (0x1U<<12)
#define DSIHOST_DSI_VMCR_LPVAE          (0x1U<<11)
#define DSIHOST_DSI_VMCR_LPVFPE         (0x1U<<10)
#define DSIHOST_DSI_VMCR_LPVBPE         (0x1U<<9)
#define DSIHOST_DSI_VMCR_LPVSAE         (0x1U<<8)
#define DSIHOST_DSI_VMCR_VMT            (0x3U<<0)
#define DSIHOST_DSI_VMCR_VMT_0          (0x1U<<0)

// DSI_VPCR Configuration

#define DSIHOST_DSI_VPCR_VPSIZE         (0x3FFFU<<0)
#define DSIHOST_DSI_VPCR_VPSIZE_0       (0x1U<<0)

// DSI_VCCR Configuration

#define DSIHOST_DSI_VCCR_NUMC           (0x1FFFU<<0)
#define DSIHOST_DSI_VCCR_NUMC_0         (0x1U<<0)

// DSI_VNPCR Configuration

#define DSIHOST_DSI_VNPCR_NPSIZE        (0x1FFFU<<0)
#define DSIHOST_DSI_VNPCR_NPSIZE_0      (0x1U<<0)

// DSI_VHSACR Configuration

#define DSIHOST_DSI_VHSACR_HSA          (0xFFFU<<0)
#define DSIHOST_DSI_VHSACR_HSA_0        (0x1U<<0)

// DSI_VHBPCR Configuration

#define DSIHOST_DSI_VHBPCR_HBP          (0xFFFU<<0)
#define DSIHOST_DSI_VHBPCR_HBP_0        (0x1U<<0)

// DSI_VLCR Configuration

#define DSIHOST_DSI_VLCR_HLINE          (0x7FFFU<<0)
#define DSIHOST_DSI_VLCR_HLINE_0        (0x1U<<0)

// DSI_VVSACR Configuration

#define DSIHOST_DSI_VVSACR_VSA          (0x3FFU<<0)
#define DSIHOST_DSI_VVSACR_VSA_0        (0x1U<<0)

// DSI_VVBPCR Configuration

#define DSIHOST_DSI_VVBPCR_VBP          (0x3FFU<<0)
#define DSIHOST_DSI_VVBPCR_VBP_0        (0x1U<<0)

// DSI_VVFPCR Configuration

#define DSIHOST_DSI_VVFPCR_VFP          (0x3FFU<<0)
#define DSIHOST_DSI_VVFPCR_VFP_0        (0x1U<<0)

// DSI_VVACR Configuration

#define DSIHOST_DSI_VVACR_VA            (0x3FFFU<<0)
#define DSIHOST_DSI_VVACR_VA_0          (0x1U<<0)

// DSI_LCCR Configuration

#define DSIHOST_DSI_LCCR_CMDSIZE        (0xFFFFU<<0)
#define DSIHOST_DSI_LCCR_CMDSIZE_0      (0x1U<<0)

// DSI_CMCR Configuration

#define DSIHOST_DSI_CMCR_MRDPS          (0x1U<<24)
#define DSIHOST_DSI_CMCR_DLWTX          (0x1U<<19)
#define DSIHOST_DSI_CMCR_DSR0TX         (0x1U<<18)
#define DSIHOST_DSI_CMCR_DSW1TX         (0x1U<<17)
#define DSIHOST_DSI_CMCR_DSW0TX         (0x1U<<16)
#define DSIHOST_DSI_CMCR_GLWTX          (0x1U<<14)
#define DSIHOST_DSI_CMCR_GSR2TX         (0x1U<<13)
#define DSIHOST_DSI_CMCR_GSR1TX         (0x1U<<12)
#define DSIHOST_DSI_CMCR_GSR0TX         (0x1U<<11)
#define DSIHOST_DSI_CMCR_GSW2TX         (0x1U<<10)
#define DSIHOST_DSI_CMCR_GSW1TX         (0x1U<<9)
#define DSIHOST_DSI_CMCR_GSW0TX         (0x1U<<8)
#define DSIHOST_DSI_CMCR_ARE            (0x1U<<1)
#define DSIHOST_DSI_CMCR_TEARE          (0x1U<<0)

// DSI_GHCR Configuration

#define DSIHOST_DSI_GHCR_WCMSB          (0xFFU<<16)
#define DSIHOST_DSI_GHCR_WCMSB_0        (0x1U<<16)
#define DSIHOST_DSI_GHCR_WCLSB          (0xFFU<<8)
#define DSIHOST_DSI_GHCR_WCLSB_0        (0x1U<<8)
#define DSIHOST_DSI_GHCR_VCID           (0x3U<<6)
#define DSIHOST_DSI_GHCR_VCID_0         (0x1U<<6)
#define DSIHOST_DSI_GHCR_DT             (0x3FU<<0)
#define DSIHOST_DSI_GHCR_DT_0           (0x1U<<0)

// DSI_GPDR Configuration

#define DSIHOST_DSI_GPDR_DATA4          (0xFFU<<24)
#define DSIHOST_DSI_GPDR_DATA4_0        (0x1U<<24)
#define DSIHOST_DSI_GPDR_DATA3          (0xFFU<<16)
#define DSIHOST_DSI_GPDR_DATA3_0        (0x1U<<16)
#define DSIHOST_DSI_GPDR_DATA2          (0xFFU<<8)
#define DSIHOST_DSI_GPDR_DATA2_0        (0x1U<<8)
#define DSIHOST_DSI_GPDR_DATA1          (0xFFU<<0)
#define DSIHOST_DSI_GPDR_DATA1_0        (0x1U<<0)

// DSI_GPSR Configuration

#define DSIHOST_DSI_GPSR_RCB            (0x1U<<6)
#define DSIHOST_DSI_GPSR_PRDFF          (0x1U<<5)
#define DSIHOST_DSI_GPSR_PRDFE          (0x1U<<4)
#define DSIHOST_DSI_GPSR_PWRFF          (0x1U<<3)
#define DSIHOST_DSI_GPSR_PWRFE          (0x1U<<2)
#define DSIHOST_DSI_GPSR_CMDFF          (0x1U<<1)
#define DSIHOST_DSI_GPSR_CMDFE          (0x1U<<0)

// DSI_TCCR0 Configuration

#define DSIHOST_DSI_TCCR0_HSTX_TOCNT    (0xFFFFU<<16)
#define DSIHOST_DSI_TCCR0_HSTX_TOCNT_0  (0x1U<<16)
#define DSIHOST_DSI_TCCR0_LPRX_TOCNT    (0xFFFFU<<0)
#define DSIHOST_DSI_TCCR0_LPRX_TOCNT_0  (0x1U<<0)

// DSI_TCCR1 Configuration

#define DSIHOST_DSI_TCCR1_HSRD_TOCNT    (0xFFFFU<<0)
#define DSIHOST_DSI_TCCR1_HSRD_TOCNT_0  (0x1U<<0)

// DSI_TCCR2 Configuration

#define DSIHOST_DSI_TCCR2_LPRD_TOCNT    (0xFFFFU<<0)
#define DSIHOST_DSI_TCCR2_LPRD_TOCNT_0  (0x1U<<0)

// DSI_TCCR3 Configuration

#define DSIHOST_DSI_TCCR3_PM            (0x1U<<24)
#define DSIHOST_DSI_TCCR3_HSWR_TOCNT    (0xFFFFU<<0)
#define DSIHOST_DSI_TCCR3_HSWR_TOCNT_0  (0x1U<<0)

// DSI_TCCR4 Configuration

#define DSIHOST_DSI_TCCR4_LPWR_TOCNT    (0xFFFFU<<0)
#define DSIHOST_DSI_TCCR4_LPWR_TOCNT_0  (0x1U<<0)

// DSI_TCCR5 Configuration

#define DSIHOST_DSI_TCCR5_BTA_TOCNT     (0xFFFFU<<0)
#define DSIHOST_DSI_TCCR5_BTA_TOCNT_0   (0x1U<<0)

