Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_dsihost.h
// DSI_CLCR Configuration

#define DSIHOST_DSI_CLCR_ACR            (0x1U<<1)
#define DSIHOST_DSI_CLCR_DPCC           (0x1U<<0)

// DSI_CLTCR Configuration

#define DSIHOST_DSI_CLTCR_HS2LP_TIME    (0x3FFU<<16)
#define DSIHOST_DSI_CLTCR_HS2LP_TIME_0  (0x1U<<16)
#define DSIHOST_DSI_CLTCR_LP2HS_TIME    (0x3FFU<<0)
#define DSIHOST_DSI_CLTCR_LP2HS_TIME_0  (0x1U<<0)

// DSI_DLTCR Configuration

#define DSIHOST_DSI_DLTCR_HS2LP_TIME    (0xFFU<<24)
#define DSIHOST_DSI_DLTCR_HS2LP_TIME_0  (0x1U<<24)
#define DSIHOST_DSI_DLTCR_LP2HS_TIME    (0xFFU<<16)
#define DSIHOST_DSI_DLTCR_LP2HS_TIME_0  (0x1U<<16)
#define DSIHOST_DSI_DLTCR_MRD_TIME      (0x7FFFU<<0)
#define DSIHOST_DSI_DLTCR_MRD_TIME_0    (0x1U<<0)

// DSI_PCTLR Configuration

#define DSIHOST_DSI_PCTLR_CKE           (0x1U<<2)
#define DSIHOST_DSI_PCTLR_DEN           (0x1U<<1)

// DSI_PCONFR Configuration

#define DSIHOST_DSI_PCONFR_SW_TIME      (0xFFU<<8)
#define DSIHOST_DSI_PCONFR_SW_TIME_0    (0x1U<<8)
#define DSIHOST_DSI_PCONFR_NL           (0x3U<<0)
#define DSIHOST_DSI_PCONFR_NL_0         (0x1U<<0)

// DSI_PUCR Configuration

#define DSIHOST_DSI_PUCR_UEDL           (0x1U<<3)
#define DSIHOST_DSI_PUCR_URDL           (0x1U<<2)
#define DSIHOST_DSI_PUCR_UECL           (0x1U<<1)
#define DSIHOST_DSI_PUCR_URCL           (0x1U<<0)

// DSI_PTTCR Configuration

#define DSIHOST_DSI_PTTCR_TX_TRIG       (0xFU<<0)
#define DSIHOST_DSI_PTTCR_TX_TRIG_0     (0x1U<<0)

// DSI_PSR Configuration

#define DSIHOST_DSI_PSR_UAN1            (0x1U<<8)
#define DSIHOST_DSI_PSR_PSS1            (0x1U<<7)
#define DSIHOST_DSI_PSR_RUE0            (0x1U<<6)
#define DSIHOST_DSI_PSR_UAN0            (0x1U<<5)
#define DSIHOST_DSI_PSR_PSS0            (0x1U<<4)
#define DSIHOST_DSI_PSR_UANC            (0x1U<<3)
#define DSIHOST_DSI_PSR_PSSC            (0x1U<<2)
#define DSIHOST_DSI_PSR_PD              (0x1U<<1)

// DSI_ISR0 Configuration

#define DSIHOST_DSI_ISR0_PE4            (0x1U<<20)
#define DSIHOST_DSI_ISR0_PE3            (0x1U<<19)
#define DSIHOST_DSI_ISR0_PE2            (0x1U<<18)
#define DSIHOST_DSI_ISR0_PE1            (0x1U<<17)
#define DSIHOST_DSI_ISR0_PE0            (0x1U<<16)
#define DSIHOST_DSI_ISR0_AE15           (0x1U<<15)
#define DSIHOST_DSI_ISR0_AE14           (0x1U<<14)
#define DSIHOST_DSI_ISR0_AE13           (0x1U<<13)
#define DSIHOST_DSI_ISR0_AE12           (0x1U<<12)
#define DSIHOST_DSI_ISR0_AE11           (0x1U<<11)
#define DSIHOST_DSI_ISR0_AE10           (0x1U<<10)
#define DSIHOST_DSI_ISR0_AE9            (0x1U<<9)
#define DSIHOST_DSI_ISR0_AE8            (0x1U<<8)
#define DSIHOST_DSI_ISR0_AE7            (0x1U<<7)
#define DSIHOST_DSI_ISR0_AE6            (0x1U<<6)
#define DSIHOST_DSI_ISR0_AE5            (0x1U<<5)
#define DSIHOST_DSI_ISR0_AE4            (0x1U<<4)
#define DSIHOST_DSI_ISR0_AE3            (0x1U<<3)
#define DSIHOST_DSI_ISR0_AE2            (0x1U<<2)
#define DSIHOST_DSI_ISR0_AE1            (0x1U<<1)
#define DSIHOST_DSI_ISR0_AE0            (0x1U<<0)

// DSI_ISR1 Configuration

#define DSIHOST_DSI_ISR1_GPRXE          (0x1U<<12)
#define DSIHOST_DSI_ISR1_GPRDE          (0x1U<<11)
#define DSIHOST_DSI_ISR1_GPTXE          (0x1U<<10)
#define DSIHOST_DSI_ISR1_GPWRE          (0x1U<<9)
#define DSIHOST_DSI_ISR1_GCWRE          (0x1U<<8)
#define DSIHOST_DSI_ISR1_LPWRE          (0x1U<<7)
#define DSIHOST_DSI_ISR1_EOTPE          (0x1U<<6)
#define DSIHOST_DSI_ISR1_PSE            (0x1U<<5)
#define DSIHOST_DSI_ISR1_CRCE           (0x1U<<4)
#define DSIHOST_DSI_ISR1_ECCME          (0x1U<<3)
#define DSIHOST_DSI_ISR1_ECCSE          (0x1U<<2)
#define DSIHOST_DSI_ISR1_TOLPRX         (0x1U<<1)
#define DSIHOST_DSI_ISR1_TOHSTX         (0x1U<<0)

// DSI_IER0 Configuration

#define DSIHOST_DSI_IER0_PE4IE          (0x1U<<20)
#define DSIHOST_DSI_IER0_PE3IE          (0x1U<<19)
#define DSIHOST_DSI_IER0_PE2IE          (0x1U<<18)
#define DSIHOST_DSI_IER0_PE1IE          (0x1U<<17)
#define DSIHOST_DSI_IER0_PE0IE          (0x1U<<16)
#define DSIHOST_DSI_IER0_AE15IE         (0x1U<<15)
#define DSIHOST_DSI_IER0_AE14IE         (0x1U<<14)
#define DSIHOST_DSI_IER0_AE13IE         (0x1U<<13)
#define DSIHOST_DSI_IER0_AE12IE         (0x1U<<12)
#define DSIHOST_DSI_IER0_AE11IE         (0x1U<<11)
#define DSIHOST_DSI_IER0_AE10IE         (0x1U<<10)
#define DSIHOST_DSI_IER0_AE9IE          (0x1U<<9)
#define DSIHOST_DSI_IER0_AE8IE          (0x1U<<8)
#define DSIHOST_DSI_IER0_AE7IE          (0x1U<<7)
#define DSIHOST_DSI_IER0_AE6IE          (0x1U<<6)
#define DSIHOST_DSI_IER0_AE5IE          (0x1U<<5)
#define DSIHOST_DSI_IER0_AE4IE          (0x1U<<4)
#define DSIHOST_DSI_IER0_AE3IE          (0x1U<<3)
#define DSIHOST_DSI_IER0_AE2IE          (0x1U<<2)
#define DSIHOST_DSI_IER0_AE1IE          (0x1U<<1)
#define DSIHOST_DSI_IER0_AE0IE          (0x1U<<0)

// DSI_IER1 Configuration

#define DSIHOST_DSI_IER1_GPRXEIE        (0x1U<<12)
#define DSIHOST_DSI_IER1_GPRDEIE        (0x1U<<11)
#define DSIHOST_DSI_IER1_GPTXEIE        (0x1U<<10)
#define DSIHOST_DSI_IER1_GPWREIE        (0x1U<<9)
#define DSIHOST_DSI_IER1_GCWREIE        (0x1U<<8)
#define DSIHOST_DSI_IER1_LPWREIE        (0x1U<<7)
#define DSIHOST_DSI_IER1_EOTPEIE        (0x1U<<6)
#define DSIHOST_DSI_IER1_PSEIE          (0x1U<<5)
#define DSIHOST_DSI_IER1_CRCEIE         (0x1U<<4)
#define DSIHOST_DSI_IER1_ECCMEIE        (0x1U<<3)
#define DSIHOST_DSI_IER1_ECCSEIE        (0x1U<<2)
#define DSIHOST_DSI_IER1_TOLPRXIE       (0x1U<<1)
#define DSIHOST_DSI_IER1_TOHSTXIE       (0x1U<<0)

// DSI_FIR0 Configuration

#define DSIHOST_DSI_FIR0_FPE4           (0x1U<<20)
#define DSIHOST_DSI_FIR0_FPE3           (0x1U<<19)
#define DSIHOST_DSI_FIR0_FPE2           (0x1U<<18)
#define DSIHOST_DSI_FIR0_FPE1           (0x1U<<17)
#define DSIHOST_DSI_FIR0_FPE0           (0x1U<<16)
#define DSIHOST_DSI_FIR0_FAE15          (0x1U<<15)
#define DSIHOST_DSI_FIR0_FAE14          (0x1U<<14)
#define DSIHOST_DSI_FIR0_FAE13          (0x1U<<13)
#define DSIHOST_DSI_FIR0_FAE12          (0x1U<<12)
#define DSIHOST_DSI_FIR0_FAE11          (0x1U<<11)
#define DSIHOST_DSI_FIR0_FAE10          (0x1U<<10)
#define DSIHOST_DSI_FIR0_FAE9           (0x1U<<9)
#define DSIHOST_DSI_FIR0_FAE8           (0x1U<<8)
#define DSIHOST_DSI_FIR0_FAE7           (0x1U<<7)
#define DSIHOST_DSI_FIR0_FAE6           (0x1U<<6)
#define DSIHOST_DSI_FIR0_FAE5           (0x1U<<5)
#define DSIHOST_DSI_FIR0_FAE4           (0x1U<<4)
#define DSIHOST_DSI_FIR0_FAE3           (0x1U<<3)
#define DSIHOST_DSI_FIR0_FAE2           (0x1U<<2)
#define DSIHOST_DSI_FIR0_FAE1           (0x1U<<1)
#define DSIHOST_DSI_FIR0_FAE0           (0x1U<<0)

// DSI_FIR1 Configuration

