Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_dsihost.h
#define DSIHOST_DSI_FIR1_FGPRXE         (0x1U<<12)
#define DSIHOST_DSI_FIR1_FGPRDE         (0x1U<<11)
#define DSIHOST_DSI_FIR1_FGPTXE         (0x1U<<10)
#define DSIHOST_DSI_FIR1_FGPWRE         (0x1U<<9)
#define DSIHOST_DSI_FIR1_FGCWRE         (0x1U<<8)
#define DSIHOST_DSI_FIR1_FLPWRE         (0x1U<<7)
#define DSIHOST_DSI_FIR1_FEOTPE         (0x1U<<6)
#define DSIHOST_DSI_FIR1_FPSE           (0x1U<<5)
#define DSIHOST_DSI_FIR1_FCRCE          (0x1U<<4)
#define DSIHOST_DSI_FIR1_FECCME         (0x1U<<3)
#define DSIHOST_DSI_FIR1_FECCSE         (0x1U<<2)
#define DSIHOST_DSI_FIR1_FTOLPRX        (0x1U<<1)
#define DSIHOST_DSI_FIR1_FTOHSTX        (0x1U<<0)

// DSI_VSCR Configuration

#define DSIHOST_DSI_VSCR_UR             (0x1U<<8)
#define DSIHOST_DSI_VSCR_EN             (0x1U<<0)

// DSI_LCVCIDR Configuration

#define DSIHOST_DSI_LCVCIDR_VCID        (0x3U<<0)
#define DSIHOST_DSI_LCVCIDR_VCID_0      (0x1U<<0)

// DSI_LCCCR Configuration

#define DSIHOST_DSI_LCCCR_LPE           (0x1U<<8)
#define DSIHOST_DSI_LCCCR_COLC          (0xFU<<0)
#define DSIHOST_DSI_LCCCR_COLC_0        (0x1U<<0)

// DSI_LPMCCR Configuration

#define DSIHOST_DSI_LPMCCR_LPSIZE       (0xFFU<<16)
#define DSIHOST_DSI_LPMCCR_LPSIZE_0     (0x1U<<16)
#define DSIHOST_DSI_LPMCCR_VLPSIZE      (0xFFU<<0)
#define DSIHOST_DSI_LPMCCR_VLPSIZE_0    (0x1U<<0)

// DSI_VMCCR Configuration

#define DSIHOST_DSI_VMCCR_LPCE          (0x1U<<9)
#define DSIHOST_DSI_VMCCR_FBTAAE        (0x1U<<8)
#define DSIHOST_DSI_VMCCR_LPHFE         (0x1U<<7)
#define DSIHOST_DSI_VMCCR_LPHBPE        (0x1U<<6)
#define DSIHOST_DSI_VMCCR_LPVAE         (0x1U<<5)
#define DSIHOST_DSI_VMCCR_LPVFPE        (0x1U<<4)
#define DSIHOST_DSI_VMCCR_LPVBPE        (0x1U<<3)
#define DSIHOST_DSI_VMCCR_LPVSAE        (0x1U<<2)
#define DSIHOST_DSI_VMCCR_VMT           (0x3U<<0)
#define DSIHOST_DSI_VMCCR_VMT_0         (0x1U<<0)

// DSI_VPCCR Configuration

#define DSIHOST_DSI_VPCCR_VPSIZE        (0x3FFFU<<0)
#define DSIHOST_DSI_VPCCR_VPSIZE_0      (0x1U<<0)

// DSI_VCCCR Configuration

#define DSIHOST_DSI_VCCCR_NUMC          (0x1FFFU<<0)
#define DSIHOST_DSI_VCCCR_NUMC_0        (0x1U<<0)

// DSI_VNPCCR Configuration

#define DSIHOST_DSI_VNPCCR_NPSIZE       (0x1FFFU<<0)
#define DSIHOST_DSI_VNPCCR_NPSIZE_0     (0x1U<<0)

// DSI_VHSACCR Configuration

#define DSIHOST_DSI_VHSACCR_HSA         (0xFFFU<<0)
#define DSIHOST_DSI_VHSACCR_HSA_0       (0x1U<<0)

// DSI_VHBPCCR Configuration

#define DSIHOST_DSI_VHBPCCR_HBP         (0xFFFU<<0)
#define DSIHOST_DSI_VHBPCCR_HBP_0       (0x1U<<0)

// DSI_VLCCR Configuration

#define DSIHOST_DSI_VLCCR_HLINE         (0x7FFFU<<0)
#define DSIHOST_DSI_VLCCR_HLINE_0       (0x1U<<0)

// DSI_VVSACCR Configuration

#define DSIHOST_DSI_VVSACCR_VSA         (0x3FFU<<0)
#define DSIHOST_DSI_VVSACCR_VSA_0       (0x1U<<0)

// DSI_VVBPCCR Configuration

#define DSIHOST_DSI_VVBPCCR_VBP         (0x3FFU<<0)
#define DSIHOST_DSI_VVBPCCR_VBP_0       (0x1U<<0)

// DSI_VVFPCCR Configuration

#define DSIHOST_DSI_VVFPCCR_VFP         (0x3FFU<<0)
#define DSIHOST_DSI_VVFPCCR_VFP_0       (0x1U<<0)

// DSI_VVACCR Configuration

#define DSIHOST_DSI_VVACCR_VA           (0x3FFFU<<0)
#define DSIHOST_DSI_VVACCR_VA_0         (0x1U<<0)

// DSI_WCFGR Configuration

#define DSIHOST_DSI_WCFGR_VSPOL         (0x1U<<7)
#define DSIHOST_DSI_WCFGR_AR            (0x1U<<6)
#define DSIHOST_DSI_WCFGR_TEPOL         (0x1U<<5)
#define DSIHOST_DSI_WCFGR_TESRC         (0x1U<<4)
#define DSIHOST_DSI_WCFGR_COLMUX        (0x7U<<1)
#define DSIHOST_DSI_WCFGR_COLMUX_0      (0x1U<<1)
#define DSIHOST_DSI_WCFGR_DSIM          (0x1U<<0)

// DSI_WCR Configuration

#define DSIHOST_DSI_WCR_DSIEN           (0x1U<<3)
#define DSIHOST_DSI_WCR_LTDCEN          (0x1U<<2)
#define DSIHOST_DSI_WCR_SHTDN           (0x1U<<1)
#define DSIHOST_DSI_WCR_COLM            (0x1U<<0)

// DSI_WIER Configuration

#define DSIHOST_DSI_WIER_RRIE           (0x1U<<13)
#define DSIHOST_DSI_WIER_PLLUIE         (0x1U<<10)
#define DSIHOST_DSI_WIER_PLLLIE         (0x1U<<9)
#define DSIHOST_DSI_WIER_ERIE           (0x1U<<1)
#define DSIHOST_DSI_WIER_TEIE           (0x1U<<0)

// DSI_WISR Configuration

#define DSIHOST_DSI_WISR_RRIF           (0x1U<<13)
#define DSIHOST_DSI_WISR_RRS            (0x1U<<12)
#define DSIHOST_DSI_WISR_PLLUIF         (0x1U<<10)
#define DSIHOST_DSI_WISR_PLLLIF         (0x1U<<9)
#define DSIHOST_DSI_WISR_PLLLS          (0x1U<<8)
#define DSIHOST_DSI_WISR_BUSY           (0x1U<<2)
#define DSIHOST_DSI_WISR_ERIF           (0x1U<<1)
#define DSIHOST_DSI_WISR_TEIF           (0x1U<<0)

// DSI_WIFCR Configuration

#define DSIHOST_DSI_WIFCR_CRRIF         (0x1U<<13)
#define DSIHOST_DSI_WIFCR_CPLLUIF       (0x1U<<10)
#define DSIHOST_DSI_WIFCR_CPLLLIF       (0x1U<<9)
#define DSIHOST_DSI_WIFCR_CERIF         (0x1U<<1)
#define DSIHOST_DSI_WIFCR_CTEIF         (0x1U<<0)

// DSI_WPCR0 Configuration

#define DSIHOST_DSI_WPCR0_TCLKPOSTEN    (0x1U<<27)
#define DSIHOST_DSI_WPCR0_TLPXCEN       (0x1U<<26)
#define DSIHOST_DSI_WPCR0_THSEXITEN     (0x1U<<25)
#define DSIHOST_DSI_WPCR0_TLPXDEN       (0x1U<<24)
#define DSIHOST_DSI_WPCR0_THSZEROEN     (0x1U<<23)
#define DSIHOST_DSI_WPCR0_THSTRAILEN    (0x1U<<22)
#define DSIHOST_DSI_WPCR0_THSPREPEN     (0x1U<<21)
#define DSIHOST_DSI_WPCR0_TCLKZEROEN    (0x1U<<20)
#define DSIHOST_DSI_WPCR0_TCLKPREPEN    (0x1U<<19)
#define DSIHOST_DSI_WPCR0_PDEN          (0x1U<<18)
#define DSIHOST_DSI_WPCR0_TDDL          (0x1U<<16)
#define DSIHOST_DSI_WPCR0_CDOFFDL       (0x1U<<14)
#define DSIHOST_DSI_WPCR0_FTXSMDL       (0x1U<<13)
#define DSIHOST_DSI_WPCR0_FTXSMCL       (0x1U<<12)
#define DSIHOST_DSI_WPCR0_HSIDL1        (0x1U<<11)
#define DSIHOST_DSI_WPCR0_HSIDL0        (0x1U<<10)
#define DSIHOST_DSI_WPCR0_HSICL         (0x1U<<9)
#define DSIHOST_DSI_WPCR0_SWDL1         (0x1U<<8)
#define DSIHOST_DSI_WPCR0_SWDL0         (0x1U<<7)
#define DSIHOST_DSI_WPCR0_SWCL          (0x1U<<6)
#define DSIHOST_DSI_WPCR0_UIX4          (0x3FU<<0)
#define DSIHOST_DSI_WPCR0_UIX4_0        (0x1U<<0)

// DSI_WPCR1 Configuration

#define DSIHOST_DSI_WPCR1_LPRXFT        (0x3U<<25)
#define DSIHOST_DSI_WPCR1_LPRXFT_0      (0x1U<<25)
#define DSIHOST_DSI_WPCR1_FLPRXLPM      (0x1U<<22)
#define DSIHOST_DSI_WPCR1_HSTXSRCDL     (0x3U<<18)
#define DSIHOST_DSI_WPCR1_HSTXSRCDL_0   (0x1U<<18)
#define DSIHOST_DSI_WPCR1_HSTXSRCCL     (0x3U<<16)
#define DSIHOST_DSI_WPCR1_HSTXSRCCL_0   (0x1U<<16)
#define DSIHOST_DSI_WPCR1_SDDC          (0x1U<<12)
#define DSIHOST_DSI_WPCR1_LPSRCDL       (0x3U<<8)
#define DSIHOST_DSI_WPCR1_LPSRCDL_0     (0x1U<<8)
#define DSIHOST_DSI_WPCR1_LPSRCCL       (0x3U<<6)
#define DSIHOST_DSI_WPCR1_LPSRCCL_0     (0x1U<<6)
#define DSIHOST_DSI_WPCR1_HSTXDDL       (0x3U<<2)
#define DSIHOST_DSI_WPCR1_HSTXDDL_0     (0x1U<<2)
#define DSIHOST_DSI_WPCR1_HSTXDCL       (0x3U<<0)
#define DSIHOST_DSI_WPCR1_HSTXDCL_0     (0x1U<<0)

// DSI_WPCR2 Configuration

#define DSIHOST_DSI_WPCR2_THSTRAIL      (0xFFU<<24)
#define DSIHOST_DSI_WPCR2_THSTRAIL_0    (0x1U<<24)
#define DSIHOST_DSI_WPCR2_THSPREP       (0xFFU<<16)
#define DSIHOST_DSI_WPCR2_THSPREP_0     (0x1U<<16)
#define DSIHOST_DSI_WPCR2_TCLKZERO      (0xFFU<<8)
#define DSIHOST_DSI_WPCR2_TCLKZERO_0    (0x1U<<8)
#define DSIHOST_DSI_WPCR2_TCLKPREP      (0xFFU<<0)
#define DSIHOST_DSI_WPCR2_TCLKPREP_0    (0x1U<<0)

// DSI_WPCR3 Configuration

#define DSIHOST_DSI_WPCR3_TLPXC         (0xFFU<<24)
#define DSIHOST_DSI_WPCR3_TLPXC_0       (0x1U<<24)
#define DSIHOST_DSI_WPCR3_THSEXIT       (0xFFU<<16)
#define DSIHOST_DSI_WPCR3_THSEXIT_0     (0x1U<<16)
#define DSIHOST_DSI_WPCR3_TLPXD         (0xFFU<<8)
#define DSIHOST_DSI_WPCR3_TLPXD_0       (0x1U<<8)
#define DSIHOST_DSI_WPCR3_THSZERO       (0xFFU<<0)
#define DSIHOST_DSI_WPCR3_THSZERO_0     (0x1U<<0)

// DSI_WPCR4 Configuration

#define DSIHOST_DSI_WPCR4_TCLKPOST      (0xFFU<<0)
#define DSIHOST_DSI_WPCR4_TCLKPOST_0    (0x1U<<0)

// DSI_WRPCR Configuration

#define DSIHOST_DSI_WRPCR_REGEN         (0x1U<<24)
#define DSIHOST_DSI_WRPCR_ODF           (0x3U<<16)
#define DSIHOST_DSI_WRPCR_ODF_0         (0x1U<<16)
#define DSIHOST_DSI_WRPCR_IDF           (0xFU<<11)
#define DSIHOST_DSI_WRPCR_IDF_0         (0x1U<<11)
#define DSIHOST_DSI_WRPCR_NDIV          (0x7FU<<2)
#define DSIHOST_DSI_WRPCR_NDIV_0        (0x1U<<2)
#define DSIHOST_DSI_WRPCR_PLLEN         (0x1U<<0)
